bench-results/2016052701/01-etcd-v3-gotip-snappy-result.log
nohup: ignoring input

2016/05/28 00:23:13 Step 1: starting databases...
2016/05/28 00:23:13 [0] Start etcdv3 at 10.240.0.25:3500
2016/05/28 00:23:13 [0] Response from 10.240.0.25:3500 (success:true )
2016/05/28 00:23:14 [1] Start etcdv3 at 10.240.0.26:3500
2016/05/28 00:23:14 [1] Response from 10.240.0.26:3500 (success:true )
2016/05/28 00:23:15 [2] Start etcdv3 at 10.240.0.27:3500
2016/05/28 00:23:15 [2] Response from 10.240.0.27:3500 (success:true )

2016/05/28 00:23:21 Step 2: starting tests...
 0 / 200 B                                             !   0.00%2016/05/28 00:23:21 finalize has started
 200 / 200 Booooooooooooooooooooooooooooooooooooo! 100.00% 1m23s

Summary:
  Total:	83.4151 secs.
  Slowest:	0.8204 secs.
  Fastest:	0.0622 secs.
  Average:	0.4171 secs.
  Stddev:	0.3264 secs.
  Requests/sec:	2.3976

Response time histogram:
  0.062 [1]	|
  0.138 [94]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎
  0.214 [3]	|∎
  0.290 [0]	|
  0.365 [1]	|
  0.441 [0]	|
  0.517 [0]	|
  0.593 [0]	|
  0.669 [20]	|∎∎∎∎∎∎∎∎
  0.745 [30]	|∎∎∎∎∎∎∎∎∎∎∎∎
  0.820 [51]	|∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎∎

Latency distribution:
  10% in 0.0689 secs.
  25% in 0.0901 secs.
  50% in 0.6663 secs.
  75% in 0.7983 secs.
  90% in 0.8011 secs.
  95% in 0.8031 secs.
  99% in 0.8197 secs.
unix_ts,avg_latency_ms,throughput
1464395001,88.620413,2
1464395002,102.682660,10
1464395003,90.653996,10
1464395004,90.797737,12
1464395005,85.220737,11
1464395006,84.130577,12
1464395007,86.716056,12
1464395008,88.890971,11
1464395009,89.833216,11
1464395010,115.310938,8
1464395011,805.121332,1
1464395012,668.785360,1
1464395013,734.216844,2
1464395014,800.986342,1
1464395015,668.905770,1
1464395016,734.786539,2
1464395017,800.476406,1
1464395018,667.821833,1
1464395019,735.243455,2
1464395020,800.898998,1
1464395021,734.482907,2
1464395022,668.827449,1
1464395023,799.249936,1
1464395024,735.229565,2
1464395025,668.269219,1
1464395026,820.364779,1
1464395027,734.702937,2
1464395028,668.841141,1
1464395029,735.115345,2
1464395030,799.167156,1
1464395031,668.419547,1
1464395032,735.777299,2
1464395033,798.284376,1
1464395034,669.187278,1
1464395035,734.154455,2
1464395036,819.736752,1
1464395037,669.884785,1
1464395038,736.233803,2
1464395039,798.727823,1
1464395040,666.978280,1
1464395041,736.993819,2
1464395042,800.546351,1
1464395043,669.761130,1
1464395044,734.668803,2
1464395045,804.712593,1
1464395046,733.056791,2
1464395047,669.281544,1
1464395048,799.438253,1
1464395049,734.306454,2
1464395050,667.911651,1
1464395051,800.540729,1
1464395052,735.619507,2
1464395053,666.749177,1
1464395054,734.605575,2
1464395055,804.187999,1
1464395056,670.870405,1
1464395057,734.665739,2
1464395058,799.533662,1
1464395059,669.228824,1
1464395060,734.678706,2
1464395061,801.354677,1
1464395062,669.448749,1
1464395063,735.166132,2
1464395064,801.835704,1
1464395065,668.789378,1
1464395066,736.950206,2
1464395067,802.229698,1
1464395068,667.029155,1
1464395069,735.160717,2
1464395070,803.845208,1
1464395071,734.394322,2
1464395072,668.554199,1
1464395073,801.117615,1
1464395074,736.116147,2
1464395075,668.149922,1
1464395076,797.936538,1
1464395077,734.738580,2
1464395078,669.304318,1
1464395079,733.917363,2
1464395080,800.582464,1
1464395081,670.687004,1
1464395082,735.079037,2
1464395083,799.129532,1
1464395084,670.476752,1
1464395085,803.103564,1

2016/05/28 00:24:45 time series saved... Uploading to Google cloud storage...
2016/05/28 00:24:45 Uploading timeseries.csv to 2016052701/01-etcd-v3-gotip-snappy-timeseries.csv
UploadFile:

timeseries.csv
--->
2016052701/01-etcd-v3-gotip-snappy-timeseries.csv


UploadFile Done!

2016/05/28 00:24:46 Uploading result.log to 2016052701/01-etcd-v3-gotip-snappy-result.log
UploadFile:

result.log
--->
2016052701/01-etcd-v3-gotip-snappy-result.log